jantielens/esp32-it8951-photoframe/src/app/device_telemetry.cpp
#include "device_telemetry.h"

#include "log_manager.h"
#include "board_config.h"
#include "fs_health.h"
#include "rtos_task_utils.h"

#include <Arduino.h>
#include <WiFi.h>
#include "soc/soc_caps.h"
#include <esp_heap_caps.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/semphr.h>
#include <freertos/timers.h>

#if HAS_MQTT
#include "mqtt_manager.h"
#endif
#include "display_manager.h"
#include "max17048_fuel_gauge.h"

// Temperature sensor support (ESP32-C3, ESP32-S2, ESP32-S3, ESP32-C2, ESP32-C6, ESP32-H2)
#if SOC_TEMP_SENSOR_SUPPORTED
#include "driver/temperature_sensor.h"
#endif

// CPU usage tracking (task-based)
static SemaphoreHandle_t cpu_mutex = nullptr;
static int cpu_usage_current = -1;
static TaskHandle_t cpu_task_handle = nullptr;
static RtosTaskPsramAlloc cpu_task_alloc = {};

// Delta tracking for calculation
static uint32_t last_idle_runtime = 0;
static uint32_t last_total_runtime = 0;
static bool first_calculation = true;

static bool log_every_ms(unsigned long now_ms, unsigned long *last_ms, unsigned long interval_ms) {
    if (!last_ms) return false;
    if (*last_ms == 0 || (now_ms - *last_ms) >= interval_ms) {
        *last_ms = now_ms;
        return true;
    }
    return false;
}

// /api/health min/max window sampling (time-based rollover).
// Goal: capture short-lived dips/spikes without storing time series on-device.
// IMPORTANT:
// - Do NOT reset sampling on HTTP requests (multiple clients would interfere).
// - We keep a small "last" window and a "current" window and report a merged
//   snapshot, which is stable across multiple clients and makes a reasonable
//   effort to not miss spikes around rollover boundaries.
static portMUX_TYPE g_health_window_mux = portMUX_INITIALIZER_UNLOCKED;
static TimerHandle_t g_health_window_timer = nullptr;

static constexpr uint32_t kHealthWindowSamplePeriodMs = 200;

struct HealthWindowStats {
    bool initialized;

    size_t internal_free_min;
    size_t internal_free_max;
    size_t internal_largest_min;
    size_t internal_largest_max;
    int internal_frag_max;

    size_t psram_free_min;
    size_t psram_free_max;
    size_t psram_largest_min;
    int psram_frag_max;
};

static HealthWindowStats g_health_window_current = {};
static HealthWindowStats g_health_window_last = {};
static bool g_health_window_last_valid = false;

static unsigned long g_health_window_current_start_ms = 0;
static unsigned long g_health_window_last_start_ms = 0;
static unsigned long g_health_window_last_end_ms = 0;

static void health_window_reset() {
    portENTER_CRITICAL(&g_health_window_mux);
    g_health_window_current = {};
    g_health_window_last = {};
    g_health_window_last_valid = false;
    g_health_window_current_start_ms = millis();
    g_health_window_last_start_ms = 0;
    g_health_window_last_end_ms = 0;
    portEXIT_CRITICAL(&g_health_window_mux);
}

static int compute_fragmentation_percent(size_t free_bytes, size_t largest_bytes) {
    if (free_bytes == 0) return 0;
    if (largest_bytes > free_bytes) return 0;
    float frag = (1.0f - ((float)largest_bytes / (float)free_bytes)) * 100.0f;
    if (frag < 0) frag = 0;
    if (frag > 100) frag = 100;
    return (int)frag;
}

static void health_window_update_sample(size_t internal_free, size_t internal_largest, size_t psram_free, size_t psram_largest) {
    const int internal_frag = compute_fragmentation_percent(internal_free, internal_largest);
    const int psram_frag = compute_fragmentation_percent(psram_free, psram_largest);

    const unsigned long now_ms = millis();

    portENTER_CRITICAL(&g_health_window_mux);

    if (g_health_window_current_start_ms == 0) {
        g_health_window_current_start_ms = now_ms;
    }

    // Time-based rollover (shared across all clients).
    // Roll over BEFORE applying the sample so the boundary sample belongs to the new window.
    if ((uint32_t)(now_ms - g_health_window_current_start_ms) >= (uint32_t)HEALTH_POLL_INTERVAL_MS) {
        if (g_health_window_current.initialized) {
            g_health_window_last = g_health_window_current;
            g_health_window_last_valid = true;
            g_health_window_last_start_ms = g_health_window_current_start_ms;
            g_health_window_last_end_ms = now_ms;
        }

        g_health_window_current = {};
        g_health_window_current_start_ms = now_ms;
    }

    if (!g_health_window_current.initialized) {
        g_health_window_current.initialized = true;

        g_health_window_current.internal_free_min = internal_free;
        g_health_window_current.internal_free_max = internal_free;
        g_health_window_current.internal_largest_min = internal_largest;
        g_health_window_current.internal_largest_max = internal_largest;
        g_health_window_current.internal_frag_max = internal_frag;

        g_health_window_current.psram_free_min = psram_free;
        g_health_window_current.psram_free_max = psram_free;
        g_health_window_current.psram_largest_min = psram_largest;
        g_health_window_current.psram_frag_max = psram_frag;

        portEXIT_CRITICAL(&g_health_window_mux);
        return;
    }

    if (internal_free < g_health_window_current.internal_free_min) g_health_window_current.internal_free_min = internal_free;
    if (internal_free > g_health_window_current.internal_free_max) g_health_window_current.internal_free_max = internal_free;
    if (internal_largest < g_health_window_current.internal_largest_min) g_health_window_current.internal_largest_min = internal_largest;
    if (internal_largest > g_health_window_current.internal_largest_max) g_health_window_current.internal_largest_max = internal_largest;
    if (internal_frag > g_health_window_current.internal_frag_max) g_health_window_current.internal_frag_max = internal_frag;

    if (psram_free < g_health_window_current.psram_free_min) g_health_window_current.psram_free_min = psram_free;
    if (psram_free > g_health_window_current.psram_free_max) g_health_window_current.psram_free_max = psram_free;
    if (psram_largest < g_health_window_current.psram_largest_min) g_health_window_current.psram_largest_min = psram_largest;
    if (psram_frag > g_health_window_current.psram_frag_max) g_health_window_current.psram_frag_max = psram_frag;

    portEXIT_CRITICAL(&g_health_window_mux);
}

// Flash/sketch metadata caching (avoid re-entrant ESP-IDF image/mmap helpers)
static bool flash_cache_initialized = false;
static size_t cached_sketch_size = 0;
static size_t cached_free_sketch_space = 0;

// Cache WiFi RSSI so a late-cycle snapshot (after WiFi shutdown) can still
// report the last known RSSI from earlier in the cycle.
static int g_cached_wifi_rssi = -127;
static bool g_cached_wifi_rssi_valid = false;

