jantielens/esp32-it8951-photoframe/src/app/device_telemetry.cpp
static void fill_common(
    JsonDocument &doc,
    bool include_ip_and_channel,
    bool include_debug_fields,
    bool include_mqtt_self_report,
    bool include_fragmentation,
    bool include_display_perf,
    bool wifi_rssi_use_cache_when_disconnected
);

static void fill_health_window_fields(JsonDocument &doc);

struct HealthWindowComputed {
    uint32_t heap_internal_free_min_window;
    uint32_t heap_internal_free_max_window;

    uint32_t heap_internal_largest_min_window;
    uint32_t heap_internal_largest_max_window;
    int heap_fragmentation_max_window;

    uint32_t psram_free_min_window;
    uint32_t psram_free_max_window;
    uint32_t psram_largest_min_window;
    int psram_fragmentation_max_window;
};

static bool compute_health_window_computed(HealthWindowComputed* out);

static void health_window_get_snapshot(
    HealthWindowStats* out_last,
    bool* out_has_last,
    HealthWindowStats* out_current,
    unsigned long* out_current_start_ms,
    unsigned long* out_last_start_ms,
    unsigned long* out_last_end_ms
);

static void get_memory_snapshot(
    size_t *out_heap_free,
    size_t *out_heap_min,
    size_t *out_heap_largest,
    size_t *out_internal_free,
    size_t *out_internal_min,
    size_t *out_psram_free,
    size_t *out_psram_min,
    size_t *out_psram_largest
);

static int calculate_cpu_usage() {
    // IMPORTANT:
    // - uxTaskGetSystemState returns 0 when the provided array is too small.
    // - TaskStatus_t is fairly large; keep this out of stack (CPU monitor task stack is small).
    // - If runtime stats aren't enabled, total_runtime and ulRunTimeCounter stay 0 -> treat as unknown.
    constexpr UBaseType_t kMaxTasks = 24;
    static TaskStatus_t task_stats[kMaxTasks];

    // Guard: if there are more tasks than we can sample, bail out and log.
    // This keeps the static array size fixed (no extra RAM), while making truncation visible.
    static unsigned long last_truncation_log_ms = 0;
    const unsigned long now_ms = millis();
    const UBaseType_t expected_tasks = uxTaskGetNumberOfTasks();
    if (expected_tasks > kMaxTasks) {
        if (log_every_ms(now_ms, &last_truncation_log_ms, 5000)) {
            LOGI(
                "CPU",
                "Runtime stats truncated: tasks=%u > max=%u (cpu_usage unavailable)",
                (unsigned)expected_tasks,
                (unsigned)kMaxTasks
            );
        }
        return -1;
    }

    uint32_t total_runtime = 0;
    const int task_count = uxTaskGetSystemState(task_stats, kMaxTasks, &total_runtime);

    static unsigned long last_runtime_stats_log_ms = 0;
    if (task_count <= 0 || total_runtime == 0) {
        if (log_every_ms(now_ms, &last_runtime_stats_log_ms, 5000)) {
            LOGI(
                "CPU",
                "Runtime stats unavailable: uxTaskGetSystemState=%d total_runtime=%lu",
                task_count,
                (unsigned long)total_runtime
            );
        }
        return -1;
    }

    // Count IDLE tasks and sum their runtimes.
    uint32_t idle_runtime = 0;
    int idle_task_count = 0;
    for (UBaseType_t i = 0; i < task_count; i++) {
        const char* name = task_stats[i].pcTaskName;
        if (name && strstr(name, "IDLE") != nullptr) {
            idle_runtime += task_stats[i].ulRunTimeCounter;
            idle_task_count++;
        }
    }

    if (idle_task_count <= 0) return -1;

    // Skip first calculation (need delta)
    if (first_calculation) {
        last_idle_runtime = idle_runtime;
        last_total_runtime = total_runtime;
        first_calculation = false;
        return -1;
    }

    // Calculate delta.
    const uint32_t idle_delta = idle_runtime - last_idle_runtime;
    const uint32_t total_delta = total_runtime - last_total_runtime;

    last_idle_runtime = idle_runtime;
    last_total_runtime = total_runtime;

    if (total_delta == 0) return -1;

    const uint32_t max_idle_time = total_delta * (uint32_t)idle_task_count;
    if (max_idle_time == 0) return -1;

    const float idle_percent = ((float)idle_delta / (float)max_idle_time) * 100.0f;
    int cpu_usage = (int)(100.0f - idle_percent);

    if (cpu_usage < 0) cpu_usage = 0;
    if (cpu_usage > 100) cpu_usage = 100;

    return cpu_usage;
}

static void health_window_timer_cb(TimerHandle_t) {
    size_t heap_free = 0;
    size_t heap_min = 0;
    size_t heap_largest = 0;
    size_t internal_free = 0;
    size_t internal_min = 0;
    size_t psram_free = 0;
    size_t psram_min = 0;
    size_t psram_largest = 0;

    get_memory_snapshot(
        &heap_free,
        &heap_min,
        &heap_largest,
        &internal_free,
        &internal_min,
        &psram_free,
        &psram_min,
        &psram_largest
    );

    // heap_largest is computed as INTERNAL largest free block (see get_memory_snapshot).
    health_window_update_sample(internal_free, heap_largest, psram_free, psram_largest);
}

static void health_window_get_snapshot(
    HealthWindowStats* out_last,
    bool* out_has_last,
    HealthWindowStats* out_current,
    unsigned long* out_current_start_ms,
    unsigned long* out_last_start_ms,
    unsigned long* out_last_end_ms
) {
    if (!out_last || !out_has_last || !out_current || !out_current_start_ms || !out_last_start_ms || !out_last_end_ms) {
        return;
    }

    portENTER_CRITICAL(&g_health_window_mux);
    *out_last = g_health_window_last;
    *out_has_last = g_health_window_last_valid;
    *out_current = g_health_window_current;
    *out_current_start_ms = g_health_window_current_start_ms;
    *out_last_start_ms = g_health_window_last_start_ms;
    *out_last_end_ms = g_health_window_last_end_ms;
    portEXIT_CRITICAL(&g_health_window_mux);
}

static void log_task_stack_watermarks_one_shot() {
    const UBaseType_t task_count = uxTaskGetNumberOfTasks();
    if (task_count == 0) return;

    TaskStatus_t* tasks = nullptr;
    if (psramFound()) {
        tasks = (TaskStatus_t*)heap_caps_malloc(sizeof(TaskStatus_t) * task_count, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    }
    if (!tasks) {
        tasks = (TaskStatus_t*)heap_caps_malloc(sizeof(TaskStatus_t) * task_count, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }
    if (!tasks) {
        LOGE("Mem", "TRIPWIRE: OOM while allocating task list");
        return;
    }

    uint32_t total_runtime = 0;
    const UBaseType_t got = uxTaskGetSystemState(tasks, task_count, &total_runtime);
    if (got == 0) {
        heap_caps_free(tasks);
        LOGE("Mem", "TRIPWIRE: uxTaskGetSystemState returned 0");
        return;
    }

    // Sort by lowest high-water mark first (most at risk).
    for (UBaseType_t i = 0; i < got; i++) {
        UBaseType_t best = i;
        for (UBaseType_t j = i + 1; j < got; j++) {
            if (tasks[j].usStackHighWaterMark < tasks[best].usStackHighWaterMark) {
                best = j;
            }
        }
        if (best != i) {
            TaskStatus_t tmp = tasks[i];
            tasks[i] = tasks[best];
            tasks[best] = tmp;
        }
    }

    // Keep logs bounded.
    const UBaseType_t max_to_log = (got > 16) ? 16 : got;
    LOGI("Mem", "TRIPWIRE: task stack watermarks (worst %u/%u)", (unsigned)max_to_log, (unsigned)got);
    for (UBaseType_t i = 0; i < max_to_log; i++) {
        const unsigned bytes = (unsigned)tasks[i].usStackHighWaterMark * (unsigned)sizeof(StackType_t);
        LOGI("Stack", "%s hw=%u", tasks[i].pcTaskName ? tasks[i].pcTaskName : "(null)", bytes);
    }

    heap_caps_free(tasks);
}

DeviceMemorySnapshot device_telemetry_get_memory_snapshot() {
    DeviceMemorySnapshot snapshot = {};

    get_memory_snapshot(
        &snapshot.heap_free_bytes,
        &snapshot.heap_min_free_bytes,
        &snapshot.heap_largest_free_block_bytes,
        &snapshot.heap_internal_free_bytes,
        &snapshot.heap_internal_min_free_bytes,
        &snapshot.psram_free_bytes,
        &snapshot.psram_min_free_bytes,
        &snapshot.psram_largest_free_block_bytes
    );

    return snapshot;
}

