jantielens/esp32-it8951-photoframe/src/app/device_telemetry.cpp
void device_telemetry_log_memory_snapshot(const char *tag) {
    size_t heap_free = 0;
    size_t heap_min = 0;
    size_t heap_largest = 0;
    size_t internal_free = 0;
    size_t internal_min = 0;
    size_t psram_free = 0;
    size_t psram_min = 0;
    size_t psram_largest = 0;

    get_memory_snapshot(
        &heap_free,
        &heap_min,
        &heap_largest,
        &internal_free,
        &internal_min,
        &psram_free,
        &psram_min,
        &psram_largest
    );

    // Keep this line short to avoid fixed log buffers truncating the output.
    // Keys:
    // hf=heap_free hm=heap_min hl=heap_largest hi=internal_free hin=internal_min
    // pf=psram_free pm=psram_min pl=psram_largest
    // frag=heap fragmentation percent (based on hl/hf)

    unsigned frag_percent = 0;
    if (heap_free > 0) {
        float fragmentation = (1.0f - ((float)heap_largest / (float)heap_free)) * 100.0f;
        if (fragmentation < 0) fragmentation = 0;
        if (fragmentation > 100) fragmentation = 100;
        frag_percent = (unsigned)fragmentation;
    }

    LOGI(
        "Mem",
        "%s hf=%u hm=%u hl=%u hi=%u hin=%u frag=%u pf=%u pm=%u pl=%u",
        tag ? tag : "(null)",
        (unsigned)heap_free,
        (unsigned)heap_min,
        (unsigned)heap_largest,
        (unsigned)internal_free,
        (unsigned)internal_min,
        (unsigned)frag_percent,
        (unsigned)psram_free,
        (unsigned)psram_min,
        (unsigned)psram_largest
    );
}

void device_telemetry_check_tripwires() {
    #if MEMORY_TRIPWIRE_INTERNAL_MIN_BYTES == 0
    return;
    #else
    static bool fired = false;
    static unsigned long last_check = 0;

    if (fired) return;

    const unsigned long now = millis();
    if (last_check != 0 && (now - last_check) < (unsigned long)MEMORY_TRIPWIRE_CHECK_INTERVAL_MS) {
        return;
    }
    last_check = now;

    DeviceMemorySnapshot snapshot = device_telemetry_get_memory_snapshot();
    if (snapshot.heap_internal_min_free_bytes > (size_t)MEMORY_TRIPWIRE_INTERNAL_MIN_BYTES) {
        return;
    }

    fired = true;
    LOGI(
        "Mem",
        "TRIPWIRE fired: internal_min=%u <= %u",
        (unsigned)snapshot.heap_internal_min_free_bytes,
        (unsigned)MEMORY_TRIPWIRE_INTERNAL_MIN_BYTES
    );
    log_task_stack_watermarks_one_shot();
    #endif
}

void device_telemetry_fill_api(JsonDocument &doc) {
    fill_common(
        doc,
        /*include_ip_and_channel=*/true,
        /*include_debug_fields=*/true,
        /*include_mqtt_self_report=*/true,
        /*include_fragmentation=*/true,
        /*include_display_perf=*/true,
        /*wifi_rssi_use_cache_when_disconnected=*/false
    );

    // Min/max fields sampled by a background timer (multi-client safe).
    // We report a merged snapshot across the last complete window and the current
    // in-progress window to reduce the chance of missing short spikes around
    // rollovers without storing any time series.
    fill_health_window_fields(doc);

    // =====================================================================
    // USER-EXTEND: Add your own sensors to the web "health" API (/api/health)
    // =====================================================================
    // If you want your external sensors to show up in the web portal health widget,
    // add fields here.
    //
    // IMPORTANT:
    // - The key "cpu_temperature" is used for the SoC/internal temperature.
    //   You can safely use "temperature" for an external/ambient sensor.
    // - If you also publish these over MQTT, keep the JSON keys identical in
    //   device_telemetry_fill_mqtt() so you can reuse the same HA templates.
    //
    // Example (commented out):
    // doc["temperature"] = 23.4;
    // doc["humidity"] = 55.2;

    // Battery / power (optional): MAX17048 fuel gauge + VBUS detect.
    {
        Max17048Reading r = {};
        if (max17048_read(&r)) {
            doc["battery_voltage"] = r.voltage_v;
            doc["battery_soc"] = r.soc_percent;
            doc["battery_crate_pct_per_hour"] = r.crate_percent_per_hour;
        } else {
            // KISS: publish explicit nulls when unavailable.
            doc["battery_voltage"] = nullptr;
            doc["battery_soc"] = nullptr;
            doc["battery_crate_pct_per_hour"] = nullptr;
        }

        #if HAS_VBUS_SENSE
        pinMode(VBUS_SENSE_PIN, INPUT);
        const bool raw = (digitalRead(VBUS_SENSE_PIN) != 0);
        const bool usb_present = VBUS_SENSE_ACTIVE_HIGH ? raw : !raw;
        doc["usb_present"] = usb_present;
        doc["power_source"] = usb_present ? "usb" : "battery";
        #else
        doc["usb_present"] = nullptr;
        doc["power_source"] = nullptr;
        #endif
    }
}

void device_telemetry_fill_mqtt(JsonDocument &doc) {
    // For MQTT publishing we keep the payload focused on device/system telemetry.
    // MQTT connection/publish status is better represented by availability/LWT,
    // and many consumers can infer publish cadence from broker-side timestamps.
    // Keep mqtt_* fields in /api/health only.
    // MQTT payload: keep a focused set of system/health fields.
    // We intentionally omit display perf + fragmentation to keep the retained
    // payload small and stable.
    fill_common(
        doc,
        /*include_ip_and_channel=*/false,
        /*include_debug_fields=*/false,
        /*include_mqtt_self_report=*/false,
        /*include_fragmentation=*/false,
        /*include_display_perf=*/false,
        /*wifi_rssi_use_cache_when_disconnected=*/true
    );

    // =====================================================================
    // USER-EXTEND: Add your own sensors to the MQTT state payload
    // =====================================================================
    // The MQTT integration publishes ONE batched JSON document (retained) to:
    //   devices/<sanitized>/health/state
    // Home Assistant entities then extract values via value_template, e.g.:
    //   {{ value_json.temperature }}
    //
    // Add your custom sensor fields below.
    //
    // IMPORTANT:
    // - The key "cpu_temperature" is used for the SoC/internal temperature.
    //   You can safely use "temperature" for an external/ambient sensor.
    //
    // Example (commented out):
    // doc["temperature"] = 23.4;
    // doc["humidity"] = 55.2;

    // Battery / power (optional): MAX17048 fuel gauge + VBUS detect.
    {
        Max17048Reading r = {};
        if (max17048_read(&r)) {
            doc["battery_voltage"] = r.voltage_v;
            doc["battery_soc"] = r.soc_percent;
            doc["battery_crate_pct_per_hour"] = r.crate_percent_per_hour;
        } else {
            // KISS: publish explicit nulls when unavailable.
            doc["battery_voltage"] = nullptr;
            doc["battery_soc"] = nullptr;
            doc["battery_crate_pct_per_hour"] = nullptr;
        }

