jantielens/esp32-it8951-photoframe/src/app/device_telemetry.cpp
        #if HAS_VBUS_SENSE
        pinMode(VBUS_SENSE_PIN, INPUT);
        const bool raw = (digitalRead(VBUS_SENSE_PIN) != 0);
        const bool usb_present = VBUS_SENSE_ACTIVE_HIGH ? raw : !raw;
        doc["usb_present"] = usb_present;
        doc["power_source"] = usb_present ? "usb" : "battery";
        #else
        doc["usb_present"] = nullptr;
        doc["power_source"] = nullptr;
        #endif
    }
}

void device_telemetry_init() {
    if (flash_cache_initialized) return;

    cached_sketch_size = ESP.getSketchSize();
    cached_free_sketch_space = ESP.getFreeSketchSpace();
    flash_cache_initialized = true;
}

size_t device_telemetry_sketch_size() {
    if (!flash_cache_initialized) {
        device_telemetry_init();
    }
    return cached_sketch_size;
}

size_t device_telemetry_free_sketch_space() {
    if (!flash_cache_initialized) {
        device_telemetry_init();
    }
    return cached_free_sketch_space;
}

// Background task: Calculate CPU usage every 1s.
static void cpu_monitoring_task(void* param) {
    while (true) {
        const int new_value = calculate_cpu_usage();

        xSemaphoreTake(cpu_mutex, portMAX_DELAY);
        cpu_usage_current = new_value;
        xSemaphoreGive(cpu_mutex);

        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

void device_telemetry_start_cpu_monitoring() {
    if (cpu_task_handle != nullptr) return;  // Already started
    
    cpu_mutex = xSemaphoreCreateMutex();
    if (cpu_mutex == nullptr) {
        LOGE("CPU", "Failed to create mutex");
        return;
    }
    
#if SOC_SPIRAM_SUPPORTED
    if (heap_caps_get_total_size(MALLOC_CAP_SPIRAM) > 0) {
        const bool ok = rtos_create_task_psram_stack(
            cpu_monitoring_task,
            "cpu_monitor",
            2048,  // Stack depth (words)
            nullptr,
            1,  // Low priority
            &cpu_task_handle,
            &cpu_task_alloc
        );

        if (!ok) {
            LOGE("CPU", "Failed to create PSRAM-backed cpu_monitor task");
            abort();
        }

        LOGI("CPU", "Created task with PSRAM-backed stack");
        return;
    }
#endif

    BaseType_t result = xTaskCreate(
        cpu_monitoring_task,
        "cpu_monitor",
        2048,  // Stack depth (words)
        nullptr,
        1,  // Low priority
        &cpu_task_handle
    );

    if (result != pdPASS) {
        LOGE("CPU", "Failed to create task");
        vSemaphoreDelete(cpu_mutex);
        cpu_mutex = nullptr;
    }
}

int device_telemetry_get_cpu_usage() {
    if (cpu_mutex == nullptr) return -1;  // Not initialized

    int value = -1;
    xSemaphoreTake(cpu_mutex, portMAX_DELAY);
    value = cpu_usage_current;
    xSemaphoreGive(cpu_mutex);
    return value;
}

void device_telemetry_start_health_window_sampling() {
    if (g_health_window_timer != nullptr) return;

    health_window_reset();
    g_health_window_timer = xTimerCreate(
        "health_win",
        pdMS_TO_TICKS(kHealthWindowSamplePeriodMs),
        pdTRUE,
        nullptr,
        health_window_timer_cb
    );

    if (!g_health_window_timer) {
        LOGE("Health", "Failed to create health window timer");
        return;
    }

    if (xTimerStart(g_health_window_timer, 0) != pdPASS) {
        LOGE("Health", "Failed to start health window timer");
        xTimerDelete(g_health_window_timer, 0);
        g_health_window_timer = nullptr;
        return;
    }
}

static void fill_health_window_fields(JsonDocument &doc) {
    HealthWindowComputed c = {};
    if (!compute_health_window_computed(&c)) {
        return;
    }

    doc["heap_internal_free_min_window"] = c.heap_internal_free_min_window;
    doc["heap_internal_free_max_window"] = c.heap_internal_free_max_window;
    doc["heap_internal_largest_min_window"] = c.heap_internal_largest_min_window;
    doc["heap_internal_largest_max_window"] = c.heap_internal_largest_max_window;
    doc["heap_fragmentation_max_window"] = c.heap_fragmentation_max_window;

    doc["psram_free_min_window"] = c.psram_free_min_window;
    doc["psram_free_max_window"] = c.psram_free_max_window;
    doc["psram_largest_min_window"] = c.psram_largest_min_window;
    doc["psram_fragmentation_max_window"] = c.psram_fragmentation_max_window;
}

static bool compute_health_window_computed(HealthWindowComputed* out) {
    if (!out) return false;

    HealthWindowStats last = {};
    HealthWindowStats current = {};
    bool has_last = false;
    unsigned long current_start_ms = 0;
    unsigned long last_start_ms = 0;
    unsigned long last_end_ms = 0;

    health_window_get_snapshot(&last, &has_last, &current, &current_start_ms, &last_start_ms, &last_end_ms);

    // Also fold in instantaneous request-time values to guarantee the returned
    // band contains the point-in-time fields, even between 200ms samples.
    size_t heap_free_now = 0;
    size_t heap_min_now = 0;
    size_t heap_largest_now = 0;
    size_t internal_free_now = 0;
    size_t internal_min_now = 0;
    size_t psram_free_now = 0;
    size_t psram_min_now = 0;
    size_t psram_largest_now = 0;
    get_memory_snapshot(
        &heap_free_now,
        &heap_min_now,
        &heap_largest_now,
        &internal_free_now,
        &internal_min_now,
        &psram_free_now,
        &psram_min_now,
        &psram_largest_now
    );
    const int internal_frag_now = compute_fragmentation_percent(internal_free_now, heap_largest_now);
    const int psram_frag_now = compute_fragmentation_percent(psram_free_now, psram_largest_now);

    // Merge last-complete and current-in-progress windows.
    // This is conservative (can be slightly wider than a strict "last N seconds" window),
    // but avoids missing spikes without extra RAM.
    HealthWindowStats merged = {};

    const bool has_current = current.initialized;
    const bool has_any = (has_current || (has_last && last.initialized));
    if (has_any) {
        merged.initialized = true;

        // Start from whichever window is present.
        const HealthWindowStats* base = has_current ? &current : &last;
        merged.internal_free_min = base->internal_free_min;
        merged.internal_free_max = base->internal_free_max;
        merged.internal_largest_min = base->internal_largest_min;
        merged.internal_largest_max = base->internal_largest_max;
        merged.internal_frag_max = base->internal_frag_max;

