jantielens/esp32-it8951-photoframe/src/app/device_telemetry.cpp
        merged.psram_free_min = base->psram_free_min;
        merged.psram_free_max = base->psram_free_max;
        merged.psram_largest_min = base->psram_largest_min;
        merged.psram_frag_max = base->psram_frag_max;

        if (has_current && has_last && last.initialized) {
            if (last.internal_free_min < merged.internal_free_min) merged.internal_free_min = last.internal_free_min;
            if (last.internal_free_max > merged.internal_free_max) merged.internal_free_max = last.internal_free_max;
            if (last.internal_largest_min < merged.internal_largest_min) merged.internal_largest_min = last.internal_largest_min;
            if (last.internal_largest_max > merged.internal_largest_max) merged.internal_largest_max = last.internal_largest_max;
            if (last.internal_frag_max > merged.internal_frag_max) merged.internal_frag_max = last.internal_frag_max;

            if (last.psram_free_min < merged.psram_free_min) merged.psram_free_min = last.psram_free_min;
            if (last.psram_free_max > merged.psram_free_max) merged.psram_free_max = last.psram_free_max;
            if (last.psram_largest_min < merged.psram_largest_min) merged.psram_largest_min = last.psram_largest_min;
            if (last.psram_frag_max > merged.psram_frag_max) merged.psram_frag_max = last.psram_frag_max;
        }
    }

    if (!merged.initialized) {
        // Early boot: initialize from instantaneous values.
        merged.initialized = true;
        merged.internal_free_min = internal_free_now;
        merged.internal_free_max = internal_free_now;
        merged.internal_largest_min = heap_largest_now;
        merged.internal_largest_max = heap_largest_now;
        merged.internal_frag_max = internal_frag_now;

        merged.psram_free_min = psram_free_now;
        merged.psram_free_max = psram_free_now;
        merged.psram_largest_min = psram_largest_now;
        merged.psram_frag_max = psram_frag_now;
    }

    // Guarantee the instantaneous request-time values are within the returned band.
    if (internal_free_now < merged.internal_free_min) merged.internal_free_min = internal_free_now;
    if (internal_free_now > merged.internal_free_max) merged.internal_free_max = internal_free_now;
    if (heap_largest_now < merged.internal_largest_min) merged.internal_largest_min = heap_largest_now;
    if (heap_largest_now > merged.internal_largest_max) merged.internal_largest_max = heap_largest_now;
    if (internal_frag_now > merged.internal_frag_max) merged.internal_frag_max = internal_frag_now;

    if (psram_free_now < merged.psram_free_min) merged.psram_free_min = psram_free_now;
    if (psram_free_now > merged.psram_free_max) merged.psram_free_max = psram_free_now;
    if (psram_largest_now < merged.psram_largest_min) merged.psram_largest_min = psram_largest_now;
    if (psram_frag_now > merged.psram_frag_max) merged.psram_frag_max = psram_frag_now;

    out->heap_internal_free_min_window = (uint32_t)merged.internal_free_min;
    out->heap_internal_free_max_window = (uint32_t)merged.internal_free_max;

    out->heap_internal_largest_min_window = (uint32_t)merged.internal_largest_min;
    out->heap_internal_largest_max_window = (uint32_t)merged.internal_largest_max;
    out->heap_fragmentation_max_window = merged.internal_frag_max;

    out->psram_free_min_window = (uint32_t)merged.psram_free_min;
    out->psram_free_max_window = (uint32_t)merged.psram_free_max;
    out->psram_largest_min_window = (uint32_t)merged.psram_largest_min;
    out->psram_fragmentation_max_window = merged.psram_frag_max;

    return true;
}

bool device_telemetry_get_health_window_bands(DeviceHealthWindowBands* out_bands) {
    if (!out_bands) return false;
    HealthWindowComputed c = {};
    if (!compute_health_window_computed(&c)) return false;

    out_bands->heap_internal_free_min_window = c.heap_internal_free_min_window;
    out_bands->heap_internal_free_max_window = c.heap_internal_free_max_window;
    out_bands->psram_free_min_window = c.psram_free_min_window;
    out_bands->psram_free_max_window = c.psram_free_max_window;
    out_bands->heap_internal_largest_min_window = c.heap_internal_largest_min_window;
    out_bands->heap_internal_largest_max_window = c.heap_internal_largest_max_window;
    return true;
}

static void fill_common(
    JsonDocument &doc,
    bool include_ip_and_channel,
    bool include_debug_fields,
    bool include_mqtt_self_report,
    bool include_fragmentation,
    bool include_display_perf,
    bool wifi_rssi_use_cache_when_disconnected
) {
    // System
    uint64_t uptime_us = esp_timer_get_time();
    doc["uptime_seconds"] = uptime_us / 1000000;

    // In SleepCycle mode, this approximates how long the device was awake for the cycle.
    // We keep millisecond precision to make short cycles visible.
    double cycle_awake_seconds = (double)uptime_us / 1000000.0;
    cycle_awake_seconds = floor(cycle_awake_seconds * 1000.0 + 0.5) / 1000.0;
    doc["cycle_awake_seconds"] = cycle_awake_seconds;

    // Reset reason
    esp_reset_reason_t reset_reason = esp_reset_reason();
    const char* reset_str = "Unknown";
    switch (reset_reason) {
        case ESP_RST_POWERON:   reset_str = "Power On"; break;
        case ESP_RST_SW:        reset_str = "Software"; break;
        case ESP_RST_PANIC:     reset_str = "Panic"; break;
        case ESP_RST_INT_WDT:   reset_str = "Interrupt WDT"; break;
        case ESP_RST_TASK_WDT:  reset_str = "Task WDT"; break;
        case ESP_RST_WDT:       reset_str = "WDT"; break;
        case ESP_RST_DEEPSLEEP: reset_str = "Deep Sleep"; break;
        case ESP_RST_BROWNOUT:  reset_str = "Brownout"; break;
        case ESP_RST_SDIO:      reset_str = "SDIO"; break;
        default: break;
    }
    doc["reset_reason"] = reset_str;

    // CPU (API includes cpu_freq; MQTT keeps payload smaller)
    if (include_debug_fields) {
        doc["cpu_freq"] = ESP.getCpuFreqMHz();
    }

    // CPU usage (nullable when runtime stats are unavailable)
    const int cpu_usage = device_telemetry_get_cpu_usage();
    if (cpu_usage < 0) {
        doc["cpu_usage"] = nullptr;
    } else {
        doc["cpu_usage"] = cpu_usage;
    }

    // CPU / SoC temperature
#if SOC_TEMP_SENSOR_SUPPORTED
    float temp_celsius = 0;
    temperature_sensor_handle_t temp_sensor = NULL;
    temperature_sensor_config_t temp_sensor_config = TEMPERATURE_SENSOR_CONFIG_DEFAULT(-10, 80);

    if (temperature_sensor_install(&temp_sensor_config, &temp_sensor) == ESP_OK) {
        if (temperature_sensor_enable(temp_sensor) == ESP_OK) {
            if (temperature_sensor_get_celsius(temp_sensor, &temp_celsius) == ESP_OK) {
                doc["cpu_temperature"] = (int)temp_celsius;
            } else {
                doc["cpu_temperature"] = nullptr;
            }
            temperature_sensor_disable(temp_sensor);
        } else {
            doc["cpu_temperature"] = nullptr;
        }
        temperature_sensor_uninstall(temp_sensor);
    } else {
        doc["cpu_temperature"] = nullptr;
    }
#else
    doc["cpu_temperature"] = nullptr;
#endif

    // Memory
    size_t heap_free = 0;
    size_t heap_min = 0;
    size_t heap_largest = 0;
    size_t internal_free = 0;
    size_t internal_min = 0;
    size_t psram_free = 0;
    size_t psram_min = 0;
    size_t psram_largest = 0;

    get_memory_snapshot(
        &heap_free,
        &heap_min,
        &heap_largest,
        &internal_free,
        &internal_min,
        &psram_free,
        &psram_min,
        &psram_largest
    );

    doc["heap_free"] = heap_free;
    doc["heap_min"] = heap_min;
    if (include_debug_fields) {
        doc["heap_size"] = ESP.getHeapSize();
    }

    // Additional heap/PSRAM details (useful for memory/fragmentation investigations)
    doc["heap_largest"] = heap_largest;
    doc["heap_internal_free"] = internal_free;
    doc["heap_internal_min"] = internal_min;
    const size_t internal_largest = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    doc["heap_internal_largest"] = internal_largest;
    doc["psram_free"] = psram_free;
    doc["psram_min"] = psram_min;
    doc["psram_largest"] = psram_largest;

    if (include_fragmentation) {
        // Heap fragmentation
        // IMPORTANT: On PSRAM boards, `heap_caps_get_largest_free_block(MALLOC_CAP_8BIT)` can return a PSRAM block,
        // while `ESP.getFreeHeap()` reports internal heap only. Mixing those yields negative fragmentation.
        // We define heap fragmentation as INTERNAL heap fragmentation.
        float heap_frag = 0;
        if (internal_free > 0 && internal_largest <= internal_free) {
            heap_frag = (1.0f - ((float)internal_largest / (float)internal_free)) * 100.0f;
        }
        if (heap_frag < 0) heap_frag = 0;
        if (heap_frag > 100) heap_frag = 100;
        doc["heap_fragmentation"] = (int)heap_frag;

        float psram_frag = 0;
        if (psram_free > 0 && psram_largest <= psram_free) {
            psram_frag = (1.0f - ((float)psram_largest / (float)psram_free)) * 100.0f;
        }
        if (psram_frag < 0) psram_frag = 0;
        if (psram_frag > 100) psram_frag = 100;
        doc["psram_fragmentation"] = (int)psram_frag;
    }

    // Flash usage
    const size_t sketch_size = device_telemetry_sketch_size();
    const size_t free_sketch_space = device_telemetry_free_sketch_space();
    doc["flash_used"] = sketch_size;
    doc["flash_total"] = sketch_size + free_sketch_space;

