jantielens/esp32-it8951-photoframe/src/app/device_telemetry.cpp
    // Filesystem health (cached; may be absent or not mounted)
    {
        FSHealthStats fs;
        fs_health_get(&fs);

        if (!fs.ffat_partition_present) {
            doc["fs_mounted"] = nullptr;
            doc["fs_used_bytes"] = nullptr;
            doc["fs_total_bytes"] = nullptr;
        } else {
            doc["fs_mounted"] = fs.ffat_mounted ? true : false;
            if (fs.ffat_mounted && fs.ffat_total_bytes > 0) {
                doc["fs_used_bytes"] = (uint64_t)fs.ffat_used_bytes;
                doc["fs_total_bytes"] = (uint64_t)fs.ffat_total_bytes;
            } else {
                doc["fs_used_bytes"] = nullptr;
                doc["fs_total_bytes"] = nullptr;
            }
        }
    }

    // MQTT health (self-report)
    // Only included in the web API (/api/health). For MQTT consumers, availability/LWT is a better
    // source of truth, and retained state can make connection booleans misleading.
    if (include_mqtt_self_report) {
        #if HAS_MQTT
        {
            doc["mqtt_enabled"] = mqtt_manager.enabled() ? true : false;
            doc["mqtt_publish_enabled"] = mqtt_manager.publishEnabled() ? true : false;
            doc["mqtt_connected"] = mqtt_manager.connected() ? true : false;

            const unsigned long last_pub = mqtt_manager.lastHealthPublishMs();
            if (last_pub == 0) {
                doc["mqtt_last_health_publish_ms"] = nullptr;
                doc["mqtt_health_publish_age_ms"] = nullptr;
            } else {
                doc["mqtt_last_health_publish_ms"] = last_pub;
                doc["mqtt_health_publish_age_ms"] = (unsigned long)(millis() - last_pub);
            }
        }
        #else
        doc["mqtt_enabled"] = false;
        doc["mqtt_publish_enabled"] = false;
        doc["mqtt_connected"] = false;
        doc["mqtt_last_health_publish_ms"] = nullptr;
        doc["mqtt_health_publish_age_ms"] = nullptr;
        #endif
    }

    if (include_display_perf) {
        // Display perf (best-effort)
        if (displayManager) {
            DisplayPerfStats stats;
            if (display_manager_get_perf_stats(&stats)) {
                doc["display_fps"] = stats.fps;
                doc["display_lv_timer_us"] = stats.lv_timer_us;
                doc["display_present_us"] = stats.present_us;
            } else {
                doc["display_fps"] = nullptr;
                doc["display_lv_timer_us"] = nullptr;
                doc["display_present_us"] = nullptr;
            }
        } else {
            doc["display_fps"] = nullptr;
            doc["display_lv_timer_us"] = nullptr;
            doc["display_present_us"] = nullptr;
        }
    }

    // WiFi stats
    if (WiFi.status() == WL_CONNECTED) {
        const int rssi = WiFi.RSSI();
        doc["wifi_rssi"] = rssi;
        g_cached_wifi_rssi = rssi;
        g_cached_wifi_rssi_valid = true;

        if (include_ip_and_channel) {
            doc["wifi_channel"] = WiFi.channel();

            // Avoid heap churn in String::toString() by formatting into a fixed buffer.
            char ip_buf[16];
            snprintf(ip_buf, sizeof(ip_buf), "%u.%u.%u.%u", WiFi.localIP()[0], WiFi.localIP()[1], WiFi.localIP()[2], WiFi.localIP()[3]);
            doc["ip_address"] = ip_buf;

            doc["hostname"] = WiFi.getHostname();
        }
    } else {
        if (wifi_rssi_use_cache_when_disconnected && g_cached_wifi_rssi_valid) {
            doc["wifi_rssi"] = g_cached_wifi_rssi;
        } else {
            doc["wifi_rssi"] = nullptr;
        }

        if (include_ip_and_channel) {
            doc["wifi_channel"] = nullptr;
            doc["ip_address"] = nullptr;
            doc["hostname"] = nullptr;
        }
    }
}

static void get_memory_snapshot(
    size_t *out_heap_free,
    size_t *out_heap_min,
    size_t *out_heap_largest,
    size_t *out_internal_free,
    size_t *out_internal_min,
    size_t *out_psram_free,
    size_t *out_psram_min,
    size_t *out_psram_largest
) {
    if (out_heap_free) *out_heap_free = ESP.getFreeHeap();
    if (out_heap_min) *out_heap_min = ESP.getMinFreeHeap();

    if (out_heap_largest) {
        // Keep this consistent with ESP.getFreeHeap() (internal heap): use INTERNAL 8-bit largest block.
        *out_heap_largest = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }

    if (out_internal_free) {
        *out_internal_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }
    if (out_internal_min) {
        *out_internal_min = heap_caps_get_minimum_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }

#if SOC_SPIRAM_SUPPORTED
    if (out_psram_free) {
        *out_psram_free = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
    }
    if (out_psram_min) {
        *out_psram_min = heap_caps_get_minimum_free_size(MALLOC_CAP_SPIRAM);
    }
    if (out_psram_largest) {
        *out_psram_largest = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);
    }
#else
    if (out_psram_free) *out_psram_free = 0;
    if (out_psram_min) *out_psram_min = 0;
    if (out_psram_largest) *out_psram_largest = 0;
#endif
}